Revit 2024 API
BuiltInFailures.AnalyticalModelFailures.ContextualAnalyticalModelModeNotEnabled Property
 Contextual Analytical Model not enabled. File open was canceled.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ContextualAnalyticalModelModeNotEnabled { get; }
Visual Basic
Public Shared ReadOnly Property ContextualAnalyticalModelModeNotEnabled As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ContextualAnalyticalModelModeNotEnabled {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace